/*
给定两个整数 a 和 b，求 a 和 b 之间的所有数字中 0∼9 的出现次数。
例如，a=1024，b=1032，则 a 和 b 之间共有 9 个数如下：
1024 1025 1026 1027 1028 1029 1030 1031 1032

其中 0 出现 10 次，1 出现 10 次，2 出现 7 次，3 出现 3 次等等…

输入格式
输入包含多组测试数据。

每组测试数据占一行，包含两个整数 a 和 b。

当读入一行为 0 0 时，表示输入终止，且该行不作处理。

输出格式
每组数据输出一个结果，每个结果占一行。
每个结果包含十个用空格隔开的数字，第一个数字表示 0 出现的次数，第二个数字表示 1 出现的次数，以此类推。
数据范围
0<a,b<100000000
输入样例：
1 10
44 497
346 542
1199 1748
1496 1403
1004 503
1714 190
1317 854
1976 494
1001 1960
0 0
输出样例：
1 2 1 1 1 1 1 1 1 1
85 185 185 185 190 96 96 96 95 93
40 40 40 93 136 82 40 40 40 40
115 666 215 215 214 205 205 154 105 106
16 113 19 20 114 20 20 19 19 16
107 105 100 101 101 197 200 200 200 200
413 1133 503 503 503 502 502 417 402 412
196 512 186 104 87 93 97 97 142 196
398 1375 398 398 405 499 499 495 488 471
294 1256 296 296 296 296 287 286 286 247
*/

#include <iostream>

// 在 1～n的范围里面，找数字 x 出现的次数
inline int find_n_x(int n,int x){
    // x 为 0 分开
    if(x == 0){

    }else{// x 不为 0
        // 截取位数

    }
}

int main(){
    int a,b;
    while(1){
        std::cin >> a >> b;
        if(a==0 && b==0){
            break;
        }


    }
    return 0;
}

/*
思路：
目标是得到f[n][i] (0 <= i <= 9)表示，从 1～n 之间数字 i 出现的次数
我们通过数位统计的方法来实现：
对于数字 n，写为一串数字：abcdefgh,我们来数第 4 位 的 3 的个数，我们的方法是：
1. 高 4 位的情况是，0000 ~ abcd - 1，那么对  fgh 就可以从 000～999均可，（10^3)。总共就是 abcd * (10^3)
2. 高 4 位的情况是，abcd
    2.1 e <  3 时，abcdexxx一定比abcd3xxx 小，所以不可能，为 0
    2.2 e == 3 时，abcd3fgh需要比abcd3xxx 小，所以为 000～fgh,有 fgh+1种选法
    2.3 e > 3  时，abcdexxx 都比abcd3fgh 大，所以有 000～999，共(10^3)种选法

这里需要注意边界情况，第一个是，前导 0
对于 1. 就需要从 0001 ～ abcd - 1 总共就是 (abcd - 1) * (10^3)
对   2. 那么就只有
            2.2 e == 0, abcd0fgh需要比 abcd0xxx 小，所以有 000～fgh,共 fgh+1 种选法
            2.3 e >  0, abcd0fgh 都比 abcdexxx 小，所以有000～999 共 (10^3)种选法

https://www.acwing.com/video/420/
*/


